{"keras_version": "2.2.4", "backend": "tensorflow", "config": {"layers": [{"config": {"strides": [1, 1], "padding": "valid", "kernel_constraint": null, "trainable": true, "dtype": "float32", "dilation_rate": [1, 1], "batch_input_shape": [null, 25, 25, 1], "data_format": "channels_last", "bias_constraint": null, "filters": 64, "kernel_size": [3, 3], "activation": "linear", "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "name": "conv2d_1", "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "name": "activation_1", "trainable": true}, "class_name": "Activation"}, {"config": {"strides": [1, 1], "padding": "valid", "kernel_constraint": null, "trainable": true, "dilation_rate": [1, 1], "data_format": "channels_last", "bias_constraint": null, "filters": 32, "kernel_size": [3, 3], "activation": "linear", "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "name": "conv2d_2", "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "name": "activation_2", "trainable": true}, "class_name": "Activation"}, {"config": {"padding": "valid", "strides": [2, 2], "trainable": true, "data_format": "channels_last", "name": "max_pooling2d_1", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"strides": [1, 1], "padding": "valid", "kernel_constraint": null, "trainable": true, "dilation_rate": [1, 1], "data_format": "channels_last", "bias_constraint": null, "filters": 16, "kernel_size": [3, 3], "activation": "linear", "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "name": "conv2d_3", "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "name": "activation_3", "trainable": true}, "class_name": "Activation"}, {"config": {"padding": "valid", "strides": [2, 2], "trainable": true, "data_format": "channels_last", "name": "max_pooling2d_2", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"strides": [1, 1], "padding": "valid", "kernel_constraint": null, "trainable": true, "dilation_rate": [1, 1], "data_format": "channels_last", "bias_constraint": null, "filters": 8, "kernel_size": [3, 3], "activation": "linear", "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "name": "conv2d_4", "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "name": "activation_4", "trainable": true}, "class_name": "Activation"}, {"config": {"padding": "valid", "strides": [2, 2], "trainable": true, "data_format": "channels_last", "name": "max_pooling2d_3", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"data_format": "channels_last", "name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"seed": null, "rate": 0.4, "name": "dropout_1", "trainable": true, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"activation": "linear", "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "kernel_regularizer": null, "units": 3, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "name": "dense_1", "trainable": true}, "class_name": "Dense"}, {"config": {"activation": "softmax", "name": "activation_5", "trainable": true}, "class_name": "Activation"}], "name": "sequential_1"}, "class_name": "Sequential"}